module.exports = {
    msgReact: [
        {
            emoji: '🥕',
            words: ['морковку', 'морковка', 'морковки', 'морковку', 'морковок', 'морковке', '🥕', 'морковкой']
        },
        {
            emoji: '🐶',
            words: ['собака', 'сука', 'пёс', 'пёсель', 'пес', 'песель', 'песелю', 'суке', 'суки', 'псу', 'псы', 'собаке', 'пёселю', 'пёсели', 'песели', '🐶']
        },
        {   
            emoji: '🐱',
            words: ['кот', 'кошка', 'кошке', 'котик', 'котику', 'котики', 'кошку', 'кошки', 'коту', 'коты', 'кота', '🐱', 'котокафе']
        },
        {   
            emoji: '🐭',
            words: ['мышь', 'мышка', 'мышке', 'мышку', 'мышки', 'мыши', 'крыса', 'крысе', 'крысы', 'крысу', 'крыска', 'крыске', 'крыски', 'крыску', '🐭']
        },
        {     
            emoji: '🐹',
            words: ['хомяк', 'хомячок', 'хомяку', 'хомяка', 'хомяки', 'хомячку', 'хомяком', 'хомячком', 'хомячкам', 'хомячки', '🐹']
        },
        { 
            emoji: '🐰',
            words: ['заяц', 'зайцы', 'зайцу', 'зайцев', 'кролик', 'кроличья', 'заичья', 'кролику', 'кролика', 'кроликов', '🐰', '🐇']
        },
        {   
            emoji: '🦊',
            words: ['лиса', 'лис', 'лису', 'лисе', 'лисы', '🦊', 'фоксхелпер']
        },
        {   
            emoji: '🐻',
            words: ['мишка', 'медведь', 'мишке', 'мишки', 'мишку', 'мишек', 'медведев', 'медведю', 'медведей', '🐻']
        },
        {   
            emoji: '🐼',
            words: ['панда', 'пандабот', 'панде', 'панду', 'кунг-фу', 'панды', '🐼']    
        },              
        {   
            emoji: '🐯',
            words: ['тигр', 'тигру', 'тигра', '🐯']
        },
        {   
            emoji: '🐮',
            words: ['корова', 'корове', 'корову', '🐮', 'коровы']
        },
        {   
            emoji: '🦆',
            words: ['утка', 'уток', 'утке', 'утки', '🦆']
        },
        {   
            emoji: '🐧',
            words: ['пингвин', 'пингвины', 'пингвину', '🐧', 'чилля', 'чилле']
        },
        {   
            emoji: '🐥',
            words: ['цыпа', 'цыплёнок', 'цыплёнку', 'цыплёнки', 'цыпу', 'цыпой', 'цыпы', '🐥']
        },
        {   
            emoji: '🐗',
            words: ['боров', 'бык', 'бычок', 'бычку', 'быку', 'быки', 'быке', 'быком', '🐗']
        },
        {   
            emoji: '🐺',
            words: ['волк', 'волки', 'волком', 'волку', 'ауф', '🐺']
        },
        {  
            emoji: '🦓',
            words: ['зебра', 'зебру', 'зебр', 'зебры', 'зебре', '🦓']
        },
        {
            emoji: '🦧',
            words: ['орангутан', 'орангутанг', 'орангутаны', 'обезьяна', 'обезьяны', 'обезьяну', 'примат', 'приматы', '🦧']
        },
        {
            emoji: '🦜',
            words: ['гоша', 'попугай', 'попугаи', 'попугаю', 'попугая', '🦜']
        },
        {
            emoji: '🦢',
            words: ['лебедь', 'лебеди', 'лебедей', 'лебедю', '🦢']
        },
        {
            emoji: '🦔',
            words: ['ёж', 'еж', 'ёжик', 'ёжика', 'ежу', 'ежа', 'ёжику', 'ежи', 'ёжики', 'ежик', 'ежика', 'ежику', 'ежики', '🦔']
        },
        {
            emoji: '🦩',
            words: ['фламинго', '🦩']
        },
        {
            emoji: '🦝',
            words: ['енот', 'енота', 'еноту', 'енотов', '🦝']
        },
        {
            emoji: '🐷',
            words: ['свинья', 'свинка', 'хрюшка', 'хрю', 'хрюк', 'поросёнок', 'поросенок', 'порося', 'хрюша', '🐷']
        },
        {
            emoji: '👑',
            words: ['степа', 'степан', 'степашка', 'стёпа', 'корона', 'царь', '👑']
        },
        {
            emoji: '🍎',
            words: ['яблоко', 'яблока', 'яблоки', 'яблоку', 'яблок', '🍎', '🍏']
        },
        {
            emoji: '🍐',
            words: ['груша', 'грушу', 'груше', 'груши', 'груш', '🍐']
        },
        {
            emoji: '🍊',
            words: ['мандарин', 'танжерин', 'мандарины', 'мандарину', 'мандарином', '🍊']
        },
        {
            emoji: '🍋',
            words: ['лимон', 'лимоны', 'лимоном', 'лимону', '🍋']
        },
        {
            emoji: '🍌',
            words: ['банан', 'бананы', 'банану', 'бананом', '🍌']
        },
        {
            emoji: '🍉',
            words: ['арбуз', 'арбузы', 'арбузом', 'арбузу', 'арбуза', 'арбузов', '🍉']
        },
        {
            emoji: '🍇',
            words: ['виноград', 'виноградина', 'виноградины', '🍇']
        },
        {
            emoji: '🍓',
            words: ['клубника', 'клубники', 'клубнику', 'клубнике', '🍓']
        },
        {
            emoji: '🍈',
            words: ['дыня', 'дыню', 'дыне', '🍈']
        },
        {
            emoji: '🍒',
            words: ['вишня', 'вишню', 'вишне', 'вишни', '🍒']
        },
        { 
            emoji: '🍑',
            words: ['персик', 'попа', 'жопа', 'персики', 'персику', 'персиком', '🍑', 'попу', 'жопу', 'попе', 'жопе']
        },
        {
            emoji: '🥭',
            words: ['манго', '🥭']
        },
        {
            emoji: '🍍',
            words: ['ананас', 'ананасами', 'ананасом', 'ананаса', 'ананасов', '🍍']
        },
        {
            emoji: '🥥',
            words: ['кокос', 'кокосы', 'кокосом', 'кокосами', 'кокосов', '🥥']
        },
        {
            emoji: '🍅',
            words: ['помидор', 'томат', 'помидоры', 'томаты', 'помидоров', '🍅']
        },
        {
            emoji: '🍆',
            words: ['баклажан', 'баклажаны', 'баклажану', 'баклажанов', 'член', 'члена', 'члены', 'членов', '🍆']
        },
        {
            emoji: '🥦',
            words: ['брокколи', '🥦']
        },
        {
            emoji: '🌶️',
            words: ['перец', 'чили', 'пеппер', 'перцы', 'перчик', 'перцем', 'перчика', 'перчики', '🌶️']
        },
        {
            emoji: '🧄',
            words: ['чеснок', 'чесноку', 'чесноком', 'чесноки', '🧄']
        },
        {
            emoji: '🧅',
            words: ['лук', 'лука', '🧅'] 
        },
        {
            emoji: '🥔',
            words: ['картошка', 'картошку', 'картошки', 'картошке', 'бульба', 'бульбу', 'бульбой', 'картошкой', 'бульбе', '🥔']
        },
        {
            emoji: '🥐',
            words: ['круассан', 'круассаны', '🥐']
        },
        {
            emoji: '🍞',
            words: ['булка', 'хлеб', 'хлеба', 'булку', 'булке', 'булкой', '🍞']
        },
        {
            emoji: '🥖',
            words: ['багет', 'багеты', 'багетом', 'багетам', '🥖']
        },
        {
            emoji: '🥚',
            words: ['яйцо', 'яйца', 'яйцами', 'яйцом', '🥚']
        },
        {
            emoji: '🍔',
            words: ['бургер', 'гамбургер', 'чизбургер', 'чикенбургер', 'роял', 'биг тейсти', '🍔']
        },
        {
            emoji: '🍕',
            words: ['пицца', 'пиццу', 'моцарелла', 'пицце', 'пиццей', '🍕']
        },
        {
            emoji: '🍣',
            words: ['суши', 'роллы', '🍣']
        },
        {
            emoji: '🍿',
            words: ['попкорн', 'попкорном', 'попкорна', '🍿']
        },
        {
            emoji: '🧀',
            words: ['сыр', '🧀'] 
        },
        {
            emoji: '🍭',
            words: ['леденец', 'леденцы', 'леденцом', '🍭']
        },
        {
            emoji: '☕',
            words: ['чай', 'кофе', 'чашка', 'чашки', 'чашке', 'чашку', 'чая', 'чаем', 'чаю', 'чаёк', 'чаек', '☕']
        },
        {
            emoji: '🍷',
            words: ['вино', 'вина', 'винцо', 'вено', '🍷']
        },
        {
            emoji: '🍺',
            words: ['квас', 'пиво', 'пива', 'кваса', 'квасу', '🍺']
        },
        {
            emoji: '🧊',
            words: ['лёд', '🧊', 'лед']
        }
    ] 
}